---
kind: method
id: M:Autodesk.Revit.DB.CurveArrArray.Clear
source: html/f4c609dd-da17-c843-7620-e9addba22c1c.htm
---
# Autodesk.Revit.DB.CurveArrArray.Clear Method

Removes every item from the array, rendering it empty.

## Syntax (C#)
```csharp
public virtual void Clear()
```